/*---------------------------------------------------------------------------*
  Project:  NitroSDK - MB - include
  File:     mb.h

  Copyright 2003-2006 Nintendo.  All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law.  They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

  $Log: mb.h,v $
  Revision 1.13  2006/01/18 02:11:29  kitase_hirotake
  do-indent

  Revision 1.12  2005/08/17 01:13:34  yosizaki
  add MB_GetMultiBootDownloadParameter().

  Revision 1.11  2005/05/20 03:11:07  yosizaki
  add MBGameRegistry::userParam.

  Revision 1.10  2005/04/11 03:37:16  yosizaki
  fix comment.

  Revision 1.9  2005/04/11 01:46:10  yosizaki
  add MB_SetLifeTime().
  add MB_SetPowerSaveMode().

  Revision 1.8  2005/03/14 07:09:33  sato_masaki
  Added MB_GetGameEntryBitmap() function.

  Revision 1.7  2005/03/01 01:57:00  yosizaki
  Revised copyright year

  Revision 1.6  2005/02/28 05:26:24  yosizaki
  do-indent.

  Revision 1.5  2004/11/24 05:14:43  yosizaki
  rename MB_StartParentEx/MB_EndEx..

  Revision 1.4  2004/11/22 12:58:17  takano_makoto
  comments added

  Revision 1.3  2004/11/18 07:34:05  takano_makoto
  Got rid of the argument for setting child transfer size in MB_SetParentCommSize, MB_SetParentCommParam


#define MB_SEGMENT_BUFFER_MIN           0x10000

/* MB API result type */
#define MB_SUCCESS                      MB_ERRCODE_SUCCESS      // Back compatible

/* Definition value that specifies that the TGID value for MB_Init() should be automatically set */
#define	MB_TGID_AUTO	0x10000

/*
 * Parent game information for multiboot
 */

#define MB_ICON_COLOR_NUM               16      // Number of icon colors
#define MB_ICON_PALETTE_SIZE            (MB_ICON_COLOR_NUM * 2) // Icon data size (16 bit color x number of colors)
#define MB_ICON_DATA_SIZE               512     // Icon data size (32x32 dots, 16 colors)
#define MB_GAME_NAME_LENGTH             48      // Game name length (2-byte units)   Note: Specify to fit within the number of characters shown to the left and within a width of 185 dots.
#define MB_GAME_INTRO_LENGTH            96      // Game description length (2-byte units)   Note: Specify to fit within the number of characters shown to the left and within a width of 199 dots x 2.
#define MB_USER_NAME_LENGTH             10      // User name length (2-byte units)
#define MB_MEMBER_MAX_NUM               15      // Maximum number of communicating members
#define MB_FILE_NO_MAX_NUM              64      // When MbGameInfo.fileNo is carried on the beacon it becomes 6-bit. Therefore the maximum number is 64.
#define MB_GAME_INFO_RECV_LIST_NUM      16      // Number of lists that receive game information on the child side.

/* Boot type */
#define MB_TYPE_ILLEGAL                 0       /* Exception status */
#define MB_TYPE_NORMAL                  1       /* Start from ROM */
#define MB_TYPE_MULTIBOOT               2       /* Multiboot child */

#define MB_BSSDESC_SIZE                 (sizeof(MBParentBssDesc))
#define MB_DOWNLOAD_PARAMETER_SIZE      HW_DOWNLOAD_PARAMETER_SIZE

/* Parent download status */
typedef enum
{
    MB_COMM_PSTATE_NONE,
    MB_COMM_PSTATE_INIT_COMPLETE,
    MB_COMM_PSTATE_CONNECTED,
    MB_COMM_PSTATE_DISCONNECTED,
    MB_COMM_PSTATE_KICKED,
    MB_COMM_PSTATE_REQ_ACCEPTED,
    MB_COMM_PSTATE_SEND_PROCEED,
    MB_COMM_PSTATE_SEND_COMPLETE,
    MB_COMM_PSTATE_BOOT_REQUEST,
    MB_COMM_PSTATE_BOOT_STARTABLE,
    MB_COMM_PSTATE_REQUESTED,
    MB_COMM_PSTATE_MEMBER_FULL,
    MB_COMM_PSTATE_END,
    MB_COMM_PSTATE_ERROR,
    MB_COMM_PSTATE_WAIT_TO_SEND,

    /*  Internally used enumerated value.
       Will not transition to this value's state. */
    MB_COMM_PSTATE_WM_EVENT = 0x80000000
}
MBCommPState;


/* Responses to connection request from child */
typedef enum
{
    MB_COMM_RESPONSE_REQUEST_KICK,     /* Reject child's entry request */
    MB_COMM_RESPONSE_REQUEST_ACCEPT,   /* Accept child's entry request */
    MB_COMM_RESPONSE_REQUEST_DOWNLOAD, /* Notifiy child of commencement of download */
    MB_COMM_RESPONSE_REQUEST_BOOT      /* Notifiy child of commencement of boot */
}
MBCommResponseRequestType;


/*  Parent event notification callback type */
typedef void (*MBCommPStateCallback) (u16 child_aid, u32 status, void *arg);


typedef struct
{
    u16     errcode;
}
MBErrorStatus;

typedef enum
{
    /* Value that indicates success */
    MB_ERRCODE_SUCCESS = 0,

    MB_ERRCODE_INVALID_PARAM,          /* Argument error */
    MB_ERRCODE_INVALID_STATE,          /* Inconsistent call state conditions */

    /* The following errors are only for children */
    MB_ERRCODE_INVALID_DLFILEINFO,     /* Invalid download information */
    MB_ERRCODE_INVALID_BLOCK_NO,       /* Received block number invalid */
    MB_ERRCODE_INVALID_BLOCK_NUM,      /* Number of blocks in received file invalid */
    MB_ERRCODE_INVALID_FILE,           /* Received block from file that was not requested */
    MB_ERRCODE_INVALID_RECV_ADDR,      /* Receive address invalid */

    /* The following errors are caused by WM errors */
    MB_ERRCODE_WM_FAILURE,             /* Error in WM callback */

    /** The following are for when communication connect is not possible. (Must re-initialize WM) **/
    MB_ERRCODE_FATAL,

    MB_ERRCODE_MAX
}
MBErrCode;

/* ---------------------------------------------------------------------

        structures

   ---------------------------------------------------------------------*/

/*
 * Multiboot game registration information structure
 */
typedef struct
{
    /* File path to program binary */
    const char *romFilePathp;
    /* Pointer to game name character string */
    u16    *gameNamep;
    /* Pointer to game content description character string */
    u16    *gameIntroductionp;
    /* Icon character data file path */
    const char *iconCharPathp;
    /* The file path of the icon palette data */
    const char *iconPalettePathp;
    /* Game group ID */
    u32     ggid;
    /* The maximum number of players */
    u8      maxPlayerNum;
    u8      pad[3];
    /* User definition extended parameters (32BYTE) */
    u8      userParam[MB_DOWNLOAD_PARAMETER_SIZE];
}
MBGameRegistry;


/*
 * Icon data structure
 * An icon is 16 color palette + 32 dots * 32 dots.
 */
typedef struct
{
    /* Palette data (32 BYTE) */
    u16     palette[MB_ICON_COLOR_NUM];
    u16     data[MB_ICON_DATA_SIZE / 2];
    /* Character data (512 bytes) */
}
MBIconInfo;                            /* 544 bytes */


/*
 * User information structure
 */
typedef struct
{
    /* Favorite color data (color set number) */
    u8      favoriteColor:4;
    /* Player number (Parent=0, Children = 1-15) */
    u8      playerNo:4;
    /* Nickname Length */
    u8      nameLength;
    /* Nickname */
    u16     name[MB_USER_NAME_LENGTH];
}
MBUserInfo;                            /* 22 bytes */


/*
 * Multiboot parent information
 * (with gameInfo[128] excluded from WMbssDesc)
 */
typedef struct
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u16     bssid[3];                  // 10
    u16     ssidLength;                // 12
    u8      ssid[32];                  // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
}
MBParentBssDesc;


/* Structure that holds parent information for mulitboot child */
typedef struct
{
    u16     boot_type;
    MBParentBssDesc parent_bss_desc;
}
MBParam;


/* Data type received when entry request comes from child */
typedef struct
{
    u32     ggid;                      //  4B
    MBUserInfo userinfo;               // 22B
    u16     version;                   //  2B
    u8      fileid;                    //  1B
    u8      pad[3];                    // Total is 29B
}
MBCommRequestData;


/* ---------------------------------------------------------------------

        Multiboot library (MB) API - For parent

   ---------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
  Name:         MB_Init

  Description:  Initialize MB library

  Arguments:    work   - Pointer to memory that is allocated for managing internal MB status.
                         This size must be at least MB_SYSTEM_BUF_SIZE bytes
                         In the case of dynamic allocation
                         also possible to acquire size with the MB_GetParentSystemBufSize function.
                         companies files as well.
                         The allocated memory is used internally until the MB_End is called.
                         

